app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT * FROM `blogs`

  def show
    @blog = Blog.find(params[:id])
---
SELECT * FROM `blogs` WHERE (`blogs`.`id` = 1)

  def create
    @blog = Blog.new(params[:blog])
    @blog.message_id=2
    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`created_at`, `title`, `updated_at`, `message_id`) VALUES('2010-09-01 06:09:41', 'my', '2010-09-01 06:09:41', 2)