app/controllers/messages_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IN (1,2,3))
SELECT * FROM `users`
---
  def index
    #@messages = Message.find(:all)
   # @messages = Message.find(:all)
    @messages = User.find(:all)
   #  @messages = Object.new(:name=>"Tushar Gandhi")
    p "In Index"
    p @messages
    m=[]
    i=1
    @messages.each {|m|

SELECT * FROM `messages` WHERE (`messages`.`id` = 0)
---
  def show
    @message = Message.find(params[:id])

INSERT INTO `messages` (`created_at`, `updated_at`, `text`, `user_id`) VALUES('2010-08-27 07:34:45', '2010-08-27 07:34:45', 'This is demo', 1)
---
  def create

    if is_amf
      @message = Message.new(:text => params[0][:text], :user_id=>2)
    else
      @message = Message.new(params[:message])
    end
    #  @message = Message.new(params[:message])

    #    respond_to do |format|
    #      if @message.save
    #        format.html { redirect_to(@message, :notice => 'Message was successfully created.') }
    #        format.xml  { render :xml => @message, :status => :created, :location => @message }
    #      else
    #        format.html { render :action => "new" }
    #        format.xml  { render :xml => @message.errors, :status => :unprocessable_entity }
    #      end
    #    end

    respond_to do |format|
      if @message.save